test/load/report.txt
npm run test:cannon

> store-project@0.0.1 test:cannon
> npx autocannon -c 1000 -d 20 --workers 10 --renderStatusCodes --latency --warmup [-c 1 -d 2] http://localhost:3000/users

Running 2s warmup @ http://localhost:3000/users
1 connections
10 workers

Running 20s test @ http://localhost:3000/users
1000 connections
10 workers

\
┌─────────┬────────┬─────────┬──────────┬──────────┬────────────┬────────────┬──────────┐
│ Stat    │ 2.5%   │ 50%     │ 97.5%    │ 99%      │ Avg        │ Stdev      │ Max      │
├─────────┼────────┼─────────┼──────────┼──────────┼────────────┼────────────┼──────────┤
│ Latency │ 624 ms │ 2121 ms │ 18022 ms │ 18960 ms │ 5034.93 ms │ 5431.88 ms │ 20186 ms │
└─────────┴────────┴─────────┴──────────┴──────────┴────────────┴────────────┴──────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬─────────┬────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg     │ Stdev  │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼────────┼─────────┤
│ Req/Sec   │ 193     │ 193     │ 296     │ 516     │ 320.36  │ 94.02  │ 193     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼────────┼─────────┤
│ Bytes/Sec │ 1.25 MB │ 1.25 MB │ 1.91 MB │ 3.33 MB │ 2.07 MB │ 607 kB │ 1.25 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴─────────┴────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 6407  │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 120          │
├────────────┼──────────────┤
│ 0.01       │ 120          │
├────────────┼──────────────┤
│ 0.1        │ 206          │
├────────────┼──────────────┤
│ 1          │ 346          │
├────────────┼──────────────┤
│ 2.5        │ 624          │
├────────────┼──────────────┤
│ 10         │ 1091         │
├────────────┼──────────────┤
│ 25         │ 1569         │
├────────────┼──────────────┤
│ 50         │ 2121         │
├────────────┼──────────────┤
│ 75         │ 7382         │
├────────────┼──────────────┤
│ 90         │ 15214        │
├────────────┼──────────────┤
│ 97.5       │ 18022        │
├────────────┼──────────────┤
│ 99         │ 18960        │
├────────────┼──────────────┤
│ 99.9       │ 19434        │
├────────────┼──────────────┤
│ 99.99      │ 20186        │
├────────────┼──────────────┤
│ 99.999     │ 20186        │
└────────────┴──────────────┘

22k requests in 20.17s, 41.4 MB read
15k errors (0 timeouts)